1) - Данные — это совокупность значений, которые в последующем могут быть обработаны и предоставленны в необходимом нам виде.
   - База данных — это хранилище данных, которое позволяет эффективно работать с большими объёмами информации.
   - Реляционная база данных — тип базы данных, в которой данные хранятся в виде связанных между собой таблиц по определнным критериям, что обеспечивает удобство управления и связи между данными.
   - Таблица — представляет собой набор строк и столбцов, где хранятся данные одного типа или по одной теме.
 2) - Поддержка реляционной модели данных
    - Безопасность данных
    - Интеграция с другими сервисами Microsoft
    - Высокая производительность и масштабируемость
    - Встроенные аналитические функции
3) - Аутентификация Windows - Это обеспечивает интегрированную безопасность без необходимости вводить отдельные логин и пароль для SQL Server.
   - Аутентификация SQL Server - Использует логин и пароль, которые создаются и хранятся непосредственно в SQL Server. Пользователь вводит эти данные для подключения независимо от учетной записи Windows.
4) 
